import OpenAI from 'openai';

const client = new OpenAI({
  apiKey: process.env.OPENAI_API_KEY, // This is the default and can be omitted
});

const info = `להלן פירוט גני משחקים, גנים ציבוריים ירוקים ומתחמי כושר מונגשים לציבור  כולל שם הגן/מתקן כתובת ומהות ההנגשה. רשימת גני משחקים מונגשים: גן גולני רח' הרצוג בר לב 21 - גישה ספסלים ברזיה גן הראשונים רח' זיידמן 16 - גישה מתקן ספסלים גן טרומן רח' טרומן 6 - גישה מתקנים ספסלים גן דרכטן רח' יהודה המכבי 1 - גישה ספסלים מתקנים גן הסנדלר ע"ש יעקובי רח' הרצל 33 - גישה ספסלים גן קק"ל רח' קק"ל 6 - גישה מתקן ספסלים גן העשרים מול רח' ההגנה 8 - גישה ספסלים מתקן גן אחידוב רח' משה סנה 1 - גישה מתקן+ספסלים רחבת האורן רח' החשמל 4 - גישה + מתקנים ספסלים פרדס רייספלד רח' הפרדס 37 - גישה +ספסלים +מתקן גן שאול המלך ע"ש בצרי רח' שאול המלך 10 אשר בצרי - גישה +ספסלים ברזיות מתקן ספורטק מערב רבין 42 - גישה ספסלים ברזיה מתקן ספורטק כיכר המזרקות רבין 42 - גישה ספסלים חורשת הפסגה רבין 24 - גישה ספסלים ומתקן גינת עבר הירדן 18 פארק חדש TRX - גישה ספסלים מתקן גינת גמלא רח' גמלא 4 - גישה ספסלים מתקן פארק נהר הירדן רח' נהר הירדן 14 פארק ישן - מתקני כושר + מתקני משחק, גישה ספסלים גן רקפת רח' רקפת 10 - גישה + מתקן ספסלים שצ"פ חורשת צה"ל רח' צה"ל 72 - גישה + מתקן ספסלים גן שרית רח' שלמה המלך 36 - גישה + מתקן ספסלים גן האיריס רח' צה"ל 74 - גישה + מתקנים ספסלים גן רימון רח' המעגל 56 - גישה + מתקן + ספסלים שי עגנון צפון רח' שי עגנון מס' 6 - גישה + מתקן +ספסלים גינת נתי רח' הזמיר 12 - גישה + ספסלים רשימת גני משחקים שיונגשו בעתיד בעיר: פארק ורשה רח' הרצל 72 נכנס לשיקום בתחילת 2021 גן יאנוש קורצ'ק-שטרן רח' שטרן 48 יונגש לאחר שיפוץ במהלך 2022 גן ששת הימים –כלנית 8 יונגש לאחר שיקום ב 2022 גן הדרור צפון – הדרור 17 יונגש במהלך 2021 לאחר שיקום. רשימת גנים ציבוריים ירוקים מונגשים לציבור: דרך איתן +משולש גינון+ +מנהרה+ קאנטרי רח' רבין 2 מול ארקפה - שביל מונגש +ספסל שצ"פ שבירו ארה השביל מול רבין 41 ליד סעדיה גאון 1 - שביל מונגש בניין העירייה רבין 41 - הנגשה כללית סמטת יעל צמוד לכצנלסון 13 - שביל מונגש גן הדסה סמטת המעפילים בין 2 ל 4 - שביל +ספסלים בית דיור מוגן צה"ל רחוב צה"ל 104 - שביל מונגש כתי וגיורא רחוב צה"ל רחוב צה"ל 103, מול 104 - רחבה מונגשת גינת התמר רחוב התמר השביל רחוב התמר 1 - שביל מונגש גינת נשלסק נשלסק ליד מס' 6 - רחבה +ספסלים רחבת דרכטן מול יהודה המכבי 1 - רחבה +ספסלים + ברזיה גן הגיבורים ליד הנשיא מס 53 - שביל +ספסלים מונגשים רחוב שטרן הקטן שטרן מס' 61 - שביל +ספסל מונגשים מעבר הגפן רחוב הגפן מס' 14 - שביל מונגש דרך הגנים דרך הגנים 2 - שביל מונגש חורשת השבעים ליד החשמל 44 - שביל מונגש חורשת השמונים כל רחוב בן גוריון - שביל מונגש ברזיה מונגשת חורשה לימודית מול רחוב המעגל מס' 18 - שביל מונגש חורשת המעגל מול רחוב המעגל 32 - שביל מונגש חורשת הנופלים הביטחון 4 - שביל מונגש + ספסלים רשימת מתחמי כושר מונגשים: צה"ל פארק הזית 12 - גישה + ספסלים צה"ל בית אבות רח' צהל 104 - גישה +ספסלים פארק רייספלד רח' הכפר 1 - גישה + ספסלים פארק ורשה רח' הרצל 72 - יפורסם ספורטק רבין 42 - גישה + ספסלים פארק נהר הירדן רח' נהר הירדן 18 - גישה +ספסלים רימון רחוב המעגל 56 - גישה גן העשרים מול 18 - גישה + ספסלים`;

const instructions =
  'From now on, respond only in Hebrew. if user ask something not related so response string as false, Answer only questions related to this web text ';

// eslint-disable-next-line consistent-return
async function sendToChatGPT(text: string): Promise<any> {
  try {
    const response = await client.chat.completions.create({
      model: 'gpt-4o',
      messages: [
        { role: 'system', content: instructions + info },
        { role: 'user', content: text },
      ],
    });

    const reply = response?.choices[0]?.message?.content;
    console.log('ChatGPT response:', reply);
    return reply;
  } catch (error) {
    console.error('Error sending to ChatGPT:', error);
  }
}

export { sendToChatGPT };
